Revit 2027 API
ReferencePoint.ShowNormalReferencePlaneOnly Property
Whether all three coordinate planes are shown, or only the normal (XY) plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowNormalReferencePlaneOnly { get; set; }
Public Property ShowNormalReferencePlaneOnly As Boolean
	Get
	Set
public:
property bool ShowNormalReferencePlaneOnly {
	bool get ();
	void set (bool value);
}
member ShowNormalReferencePlaneOnly : bool with get, set
Property Value
Boolean
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace